Autodesk.Revit.DB.RenderingSettings.LightingSource
The lighting scheme type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The enum value is not valid for Lighting.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RenderingSettings.PrinterResolution
The resolution level when using printer.
Remarks:
The suitable resolution value is decided by default. You may obtain it from the ResolutionValue property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The enum value is not valid for PrinterResolution.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The resolution target is not printer.
Since:
2013

Autodesk.Revit.DB.RenderingSettings.ResolutionTarget
The resolution target.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The enum value is not valid for ResolutionTarget.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013